{
  "subtitle": "Estas são algumas das tecnologias e ferramentas em que já tive contato.",
  "main": "Principais tecnologias",
  "others": "Outras tecnologias que usei...",
  "hover_text": "Passe o mouse nos ícones para saber mais",
  "tech_descriptions": {
    "Css": "CSS (Cascading Style Sheets) é uma linguagem de estilo utilizada para descrever a apresentação de documentos HTML ou XML. Ela define como elementos serão exibidos na tela, em papel ou em outros meios.",
    "Html": "HTML (HyperText Markup Language) é a linguagem padrão para criação de páginas web. Ele permite estruturar o conteúdo de uma página com elementos como títulos, parágrafos, links, imagens e outros.",
    "Javascript": "JavaScript é uma linguagem de programação amplamente utilizada para criar conteúdo dinâmico e interativo na web. Ele permite a manipulação de elementos HTML e CSS, além de possibilitar a comunicação com servidores web.",
    "Jest": "Jest é um framework de testes em JavaScript desenvolvido pelo Facebook. Ele é amplamente utilizado para testar aplicações React e outras bibliotecas JavaScript, oferecendo recursos como mocks, testes assíncronos e snapshots.",
    "MaterialUI": "Material-UI é uma biblioteca de componentes React que implementa as diretrizes de design Material Design do Google. Ela fornece uma ampla gama de componentes estilizados e personalizáveis para acelerar o desenvolvimento de interfaces de usuário.",
    "Next": "Next.js é um framework de desenvolvimento React que permite a criação de aplicações web de maneira simples e eficiente. Ele oferece recursos como renderização do lado do servidor, geração estática e rotas dinâmicas.",
    "React": "React é uma biblioteca JavaScript para a construção de interfaces de usuário, desenvolvida pelo Facebook. Ela facilita a criação de componentes reutilizáveis e a gestão do estado da aplicação.",
    "ReactNavigation": "React Navigation é uma biblioteca para roteamento e navegação em aplicações React Native. Ela permite criar uma navegação suave e intuitiva em aplicações móveis, com suporte para navegação em pilhas, abas e drawers.",
    "Redux": "Redux é uma biblioteca para gerenciamento de estado em aplicações JavaScript. Ele é frequentemente utilizado com React para facilitar a gestão do estado global da aplicação de forma previsível e centralizada.",
    "Sass": "Sass (Syntactically Awesome Style Sheets) é uma extensão do CSS que adiciona funcionalidades avançadas como variáveis, aninhamento, mixins e herança, tornando o desenvolvimento de estilos mais poderoso e organizado.",
    "Storybook": "Storybook é uma ferramenta de desenvolvimento que permite construir e testar componentes de UI de forma isolada. Ele é amplamente utilizado para desenvolver componentes React e criar bibliotecas de componentes reutilizáveis.",
    "Tailwind": "Tailwind CSS é um framework de CSS utilitário que permite criar interfaces de usuário rapidamente. Ele fornece classes pré-definidas para estilizar elementos sem a necessidade de escrever CSS customizado.",
    "Typescript": "TypeScript é uma linguagem de programação que estende o JavaScript, adicionando tipagem estática. Ele ajuda a prevenir erros de runtime e facilita a manutenção de grandes bases de código.",
    "Java": "Java é uma linguagem de programação de propósito geral, orientada a objetos, amplamente utilizada para desenvolver aplicações corporativas, aplicações móveis e sistemas embarcados.",
    "MySQL": "MySQL é um sistema de gerenciamento de banco de dados relacional de código aberto. Ele é amplamente utilizado para armazenar e gerenciar dados em aplicações web e corporativas.",
    "Php": "PHP é uma linguagem de script amplamente utilizada para o desenvolvimento web. Ele é especialmente adequado para a criação de páginas web dinâmicas e interativas.",
    "Postgresql": "PostgreSQL é um sistema de gerenciamento de banco de dados relacional avançado e de código aberto. Ele oferece robustez e recursos avançados para armazenamento e recuperação de dados.",
    "Python": "Python é uma linguagem de programação de alto nível, conhecida por sua simplicidade e legibilidade. Ela é amplamente utilizada em desenvolvimento web, ciência de dados, inteligência artificial e automação.",
    "Filezilla": "FileZilla é um cliente FTP de código aberto, utilizado para transferir arquivos entre um computador local e um servidor remoto. Ele suporta FTP, FTPS e SFTP.",
    "Git": "Git é um sistema de controle de versão distribuído, amplamente utilizado para rastrear mudanças em arquivos de código e coordenar o trabalho de várias pessoas em projetos de software.",
    "Github": "GitHub é uma plataforma de hospedagem de código que utiliza Git para controle de versão. Ele permite colaborar em projetos de software, revisar código e gerenciar problemas e solicitações de pull.",
    "Gitlab": "GitLab é uma plataforma de DevOps que fornece repositórios Git, CI/CD, gerenciamento de projetos e ferramentas de colaboração. Ele é projetado para facilitar o ciclo de vida completo do desenvolvimento de software.",
    "Markdown": "Markdown é uma linguagem de marcação leve, utilizada para formatar texto de maneira simples e legível. Ele é amplamente utilizado em documentação, blogs e fóruns.",
    "Npm": "NPM (Node Package Manager) é o gerenciador de pacotes padrão para o ambiente Node.js. Ele permite instalar, compartilhar e gerenciar dependências de projetos JavaScript.",
    "OhMyZsh": "Oh My Zsh é um framework de código aberto para gerenciar a configuração do shell Zsh. Ele inclui uma coleção de plugins e temas que melhoram a usabilidade do terminal.",
    "SonarQube": "SonarQube é uma plataforma de código aberto para inspeção contínua da qualidade do código. Ele detecta bugs, vulnerabilidades e fornece insights para melhorar a manutenção do software.",
    "Ubuntu": "Ubuntu é uma distribuição de Linux baseada no Debian. Ele é amplamente utilizado em servidores, desktops e no desenvolvimento de software por sua estabilidade e segurança.",
    "Vercel": "Vercel é uma plataforma de hospedagem e deploy para projetos front-end. Ele é otimizado para aplicações React, Next.js e oferece recursos como deploy contínuo e CDN integrada.",
    "Yarn": "Yarn é um gerenciador de pacotes para projetos JavaScript. Ele é uma alternativa ao NPM, focada em velocidade, segurança e consistência no gerenciamento de dependências.",
    "Canva": "Canva é uma plataforma de design gráfico que permite aos usuários criar gráficos, apresentações, pôsteres e outros conteúdos visuais de forma simples e intuitiva. Ele oferece uma ampla gama de templates e ferramentas de edição.",
    "Figma": "Figma é uma ferramenta de design de interface colaborativa baseada na web. Ele permite a criação de protótipos interativos e o trabalho em equipe em tempo real, facilitando o processo de design de produtos digitais."
  }
}
