{
  "subtitle": "Estas son algunas de las tecnologías y herramientas con las que ya he tenido contacto.",
  "main": "Principales tecnologías",
  "others": "Otras tecnologías que he usado...",
  "hover_text": "Pasa el ratón sobre los iconos para saber más",
  "tech_descriptions": {
    "Css": "CSS (Cascading Style Sheets) es un lenguaje de estilo utilizado para describir la presentación de documentos HTML o XML. Define cómo se mostrarán los elementos en la pantalla, en papel u otros medios.",
    "Html": "HTML (HyperText Markup Language) es el lenguaje estándar para la creación de páginas web. Permite estructurar el contenido de una página con elementos como títulos, párrafos, enlaces, imágenes y otros.",
    "Javascript": "JavaScript es un lenguaje de programación ampliamente utilizado para crear contenido dinámico e interactivo en la web. Permite la manipulación de elementos HTML y CSS, además de posibilitar la comunicación con servidores web.",
    "Jest": "Jest es un framework de pruebas en JavaScript desarrollado por Facebook. Es ampliamente utilizado para probar aplicaciones React y otras bibliotecas de JavaScript, ofreciendo recursos como mocks, pruebas asíncronas y snapshots.",
    "MaterialUI": "Material-UI es una biblioteca de componentes React que implementa las directrices de diseño Material Design de Google. Proporciona una amplia gama de componentes estilizados y personalizables para acelerar el desarrollo de interfaces de usuario.",
    "Next": "Next.js es un framework de desarrollo React que permite la creación de aplicaciones web de manera simple y eficiente. Ofrece características como renderizado del lado del servidor, generación estática y rutas dinámicas.",
    "React": "React es una biblioteca de JavaScript para la construcción de interfaces de usuario, desarrollada por Facebook. Facilita la creación de componentes reutilizables y la gestión del estado de la aplicación.",
    "ReactNavigation": "React Navigation es una biblioteca para enrutamiento y navegación en aplicaciones React Native. Permite crear una navegación fluida e intuitiva en aplicaciones móviles, con soporte para navegación en pilas, pestañas y drawers.",
    "Redux": "Redux es una biblioteca para gestión de estado en aplicaciones JavaScript. Es frecuentemente utilizada con React para facilitar la gestión del estado global de la aplicación de manera predecible y centralizada.",
    "Sass": "Sass (Syntactically Awesome Style Sheets) es una extensión del CSS que añade funcionalidades avanzadas como variables, anidamiento, mixins y herencia, haciendo que el desarrollo de estilos sea más poderoso y organizado.",
    "Storybook": "Storybook es una herramienta de desarrollo que permite construir y probar componentes de UI de forma aislada. Es ampliamente utilizado para desarrollar componentes React y crear bibliotecas de componentes reutilizables.",
    "Tailwind": "Tailwind CSS es un framework de CSS utilitario que permite crear interfaces de usuario rápidamente. Proporciona clases predefinidas para estilizar elementos sin necesidad de escribir CSS personalizado.",
    "Typescript": "TypeScript es un lenguaje de programación que extiende JavaScript, añadiendo tipado estático. Ayuda a prevenir errores de runtime y facilita el mantenimiento de grandes bases de código.",
    "Java": "Java es un lenguaje de programación de propósito general, orientado a objetos, ampliamente utilizado para desarrollar aplicaciones corporativas, aplicaciones móviles y sistemas embebidos.",
    "MySQL": "MySQL es un sistema de gestión de bases de datos relacional de código abierto. Es ampliamente utilizado para almacenar y gestionar datos en aplicaciones web y corporativas.",
    "Php": "PHP es un lenguaje de script ampliamente utilizado para el desarrollo web. Es especialmente adecuado para la creación de páginas web dinámicas e interactivas.",
    "Postgresql": "PostgreSQL es un sistema de gestión de bases de datos relacional avanzado y de código abierto. Ofrece robustez y características avanzadas para el almacenamiento y recuperación de datos.",
    "Python": "Python es un lenguaje de programación de alto nivel, conocido por su simplicidad y legibilidad. Es ampliamente utilizado en desarrollo web, ciencia de datos, inteligencia artificial y automatización.",
    "Filezilla": "FileZilla es un cliente FTP de código abierto, utilizado para transferir archivos entre un ordenador local y un servidor remoto. Soporta FTP, FTPS y SFTP.",
    "Git": "Git es un sistema de control de versiones distribuido, ampliamente utilizado para rastrear cambios en archivos de código y coordinar el trabajo de varias personas en proyectos de software.",
    "Github": "GitHub es una plataforma de hospedaje de código que utiliza Git para control de versiones. Permite colaborar en proyectos de software, revisar código y gestionar problemas y solicitudes de pull.",
    "Gitlab": "GitLab es una plataforma de DevOps que proporciona repositorios Git, CI/CD, gestión de proyectos y herramientas de colaboración. Está diseñado para facilitar el ciclo de vida completo del desarrollo de software.",
    "Markdown": "Markdown es un lenguaje de marcado ligero, utilizado para dar formato a texto de manera simple y legible. Es ampliamente utilizado en documentación, blogs y foros.",
    "Npm": "NPM (Node Package Manager) es el gestor de paquetes estándar para el entorno Node.js. Permite instalar, compartir y gestionar dependencias de proyectos JavaScript.",
    "OhMyZsh": "Oh My Zsh es un framework de código abierto para gestionar la configuración del shell Zsh. Incluye una colección de plugins y temas que mejoran la usabilidad del terminal.",
    "SonarQube": "SonarQube es una plataforma de código abierto para la inspección continua de la calidad del código. Detecta errores, vulnerabilidades y proporciona información para mejorar el mantenimiento del software.",
    "Ubuntu": "Ubuntu es una distribución de Linux basada en Debian. Es ampliamente utilizada en servidores, escritorios y en el desarrollo de software por su estabilidad y seguridad.",
    "Vercel": "Vercel es una plataforma de hospedaje y despliegue para proyectos front-end. Está optimizada para aplicaciones React, Next.js y ofrece características como despliegue continuo y CDN integrada.",
    "Yarn": "Yarn es un gestor de paquetes para proyectos JavaScript. Es una alternativa a NPM, enfocada en velocidad, seguridad y consistencia en la gestión de dependencias.",
    "Canva": "Canva es una plataforma de diseño gráfico que permite a los usuarios crear gráficos, presentaciones, pósteres y otros contenidos visuales de forma simple e intuitiva. Ofrece una amplia gama de plantillas y herramientas de edición.",
    "Figma": "Figma es una herramienta de diseño de interfaz colaborativa basada en la web. Permite la creación de prototipos interactivos y el trabajo en equipo en tiempo real, facilitando el proceso de diseño de productos digitales."
  }
}
