{
  "subtitle": "These are some of the technologies and tools I have already had contact with.",
  "main": "Main technologies",
  "others": "Other technologies I've used...",
  "hover_text": "Hover over the icons to learn more",
  "tech_descriptions": {
    "Css": "CSS (Cascading Style Sheets) is a style sheet language used to describe the presentation of HTML or XML documents. It defines how elements are displayed on screen, paper, or other media.",
    "Html": "HTML (HyperText Markup Language) is the standard language for creating web pages. It allows structuring the content of a page with elements such as headings, paragraphs, links, images, and more.",
    "Javascript": "JavaScript is a widely used programming language for creating dynamic and interactive content on the web. It allows manipulation of HTML and CSS elements, as well as communication with web servers.",
    "Jest": "Jest is a JavaScript testing framework developed by Facebook. It is widely used to test React applications and other JavaScript libraries, offering features such as mocks, asynchronous testing, and snapshots.",
    "MaterialUI": "Material-UI is a React component library that implements Google's Material Design guidelines. It provides a wide range of styled and customizable components to accelerate the development of user interfaces.",
    "Next": "Next.js is a React framework that allows the creation of web applications in a simple and efficient manner. It offers features like server-side rendering, static generation, and dynamic routing.",
    "React": "React is a JavaScript library for building user interfaces, developed by Facebook. It facilitates the creation of reusable components and the management of application state.",
    "ReactNavigation": "React Navigation is a library for routing and navigation in React Native applications. It enables smooth and intuitive navigation in mobile applications, with support for stacks, tabs, and drawers.",
    "Redux": "Redux is a library for state management in JavaScript applications. It is often used with React to facilitate centralized and predictable management of the application's global state.",
    "Sass": "Sass (Syntactically Awesome Style Sheets) is a CSS extension that adds advanced features such as variables, nesting, mixins, and inheritance, making style development more powerful and organized.",
    "Storybook": "Storybook is a development tool that allows building and testing UI components in isolation. It is widely used for developing React components and creating reusable component libraries.",
    "Tailwind": "Tailwind CSS is a utility-first CSS framework that allows rapid development of user interfaces. It provides pre-defined classes to style elements without the need for writing custom CSS.",
    "Typescript": "TypeScript is a programming language that extends JavaScript by adding static typing. It helps prevent runtime errors and facilitates maintenance of large codebases.",
    "Java": "Java is a general-purpose, object-oriented programming language widely used for developing enterprise applications, mobile applications, and embedded systems.",
    "MySQL": "MySQL is an open-source relational database management system. It is widely used for storing and managing data in web and enterprise applications.",
    "Php": "PHP is a widely used scripting language for web development. It is particularly suitable for creating dynamic and interactive web pages.",
    "Postgresql": "PostgreSQL is an advanced open-source relational database management system. It offers robustness and advanced features for storing and retrieving data.",
    "Python": "Python is a high-level programming language known for its simplicity and readability. It is widely used in web development, data science, artificial intelligence, and automation.",
    "Filezilla": "FileZilla is an open-source FTP client used to transfer files between a local computer and a remote server. It supports FTP, FTPS, and SFTP.",
    "Git": "Git is a distributed version control system widely used to track changes in code files and coordinate the work of multiple people on software projects.",
    "Github": "GitHub is a code hosting platform that uses Git for version control. It enables collaboration on software projects, code review, and management of issues and pull requests.",
    "Gitlab": "GitLab is a DevOps platform that provides Git repositories, CI/CD, project management, and collaboration tools. It is designed to facilitate the entire software development lifecycle.",
    "Markdown": "Markdown is a lightweight markup language used to format text in a simple and readable way. It is widely used in documentation, blogs, and forums.",
    "Npm": "NPM (Node Package Manager) is the default package manager for the Node.js environment. It allows installing, sharing, and managing dependencies of JavaScript projects.",
    "OhMyZsh": "Oh My Zsh is an open-source framework for managing Zsh shell configuration. It includes a collection of plugins and themes that enhance terminal usability.",
    "SonarQube": "SonarQube is an open-source platform for continuous inspection of code quality. It detects bugs, vulnerabilities, and provides insights to improve software maintenance.",
    "Ubuntu": "Ubuntu is a Debian-based Linux distribution. It is widely used on servers, desktops, and in software development for its stability and security.",
    "Vercel": "Vercel is a hosting and deployment platform for frontend projects. It is optimized for React, Next.js applications and offers features like continuous deployment and integrated CDN.",
    "Yarn": "Yarn is a package manager for JavaScript projects. It is an alternative to NPM, focused on speed, security, and consistency in managing dependencies.",
    "Canva": "Canva is a graphic design platform that allows users to create graphics, presentations, posters, and other visual content in a simple and intuitive way. It offers a wide range of templates and editing tools.",
    "Figma": "Figma is a collaborative web-based interface design tool. It allows creating interactive prototypes and real-time teamwork, facilitating the digital product design process."
  }
}
